## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] has changed
  ~ resource "azurerm_storage_account" "logs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Storage/storageAccounts/findatppr379logs"
        name                              = "findatppr379logs"
        tags                              = {
            "Environment"      = "pr-379"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "172.177.106.104",
              + "172.177.155.147",
                # (1 unchanged element hidden)
            ]
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-379applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-379httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_application_insights_standard_web_test.web_app_service[0] will be created
  + resource "azurerm_application_insights_standard_web_test" "web_app_service" {
      + application_insights_id = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Insights/components/find-a-tp-pr-379-insights"
      + description             = "Regional HTTP availability check"
      + enabled                 = true
      + frequency               = 300
      + geo_locations           = [
          + "emea-nl-ams-azr",
        ]
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = "find-a-tp-pr-379-http"
      + resource_group_name     = "s177d01-ntp-pr-379"
      + synthetic_monitor_id    = (known after apply)
      + tags                    = {
          + "Environment"                                                                                                                                                         = "pr-379"
          + "Product"                                                                                                                                                             = "National Tutoring Programme"
          + "Service Offering"                                                                                                                                                    = "National Tutoring Programme"
          + "hidden-link:/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Insights/components/find-a-tp-pr-379-insights" = "Resource"
        }
      + timeout                 = 10

      + request {
          + follow_redirects_enabled         = true
          + http_verb                        = "GET"
          + parse_dependent_requests_enabled = true
          + url                              = "https://find-a-tp-pr-379-cdnendpoint-bsekcbfqe3b5ergz.z01.azurefd.net/"

          + header {
              + name  = "X-AppInsights-HttpTest"
              + value = "find-a-tp-pr-379-insights"
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be updated in-place
  ~ resource "azurerm_linux_web_app" "default" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Web/sites/find-a-tp-pr-379"
        name                              = "find-a-tp-pr-379"
        tags                              = {
            "Environment"      = "pr-379"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (19 unchanged attributes hidden)

      ~ logs {
            # (2 unchanged attributes hidden)

          ~ application_logs {
                # (1 unchanged attribute hidden)

              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (2 unchanged attributes hidden)
                }
            }

          ~ http_logs {
              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_logic_app_action_http.slack[0] will be created
  + resource "azurerm_logic_app_action_http" "slack" {
      + body         = jsonencode(
            {
              + attachments = [
                  + {
                      + blocks = [
                          + {
                              + text = {
                                  + text = "@{triggerBody()?['data']?['essentials']?['alertRule']}"
                                  + type = "plain_text"
                                }
                              + type = "header"
                            },
                          + {
                              + text = {
                                  + text = "_@{triggerBody()?['data']?['essentials']?['description']}_"
                                  + type = "mrkdwn"
                                }
                              + type = "section"
                            },
                          + {
                              + fields = [
                                  + {
                                      + text = "*Severity*"
                                      + type = "mrkdwn"
                                    },
                                  + {
                                      + text = "@{triggerBody()?['data']?['essentials']?['severity']}"
                                      + type = "plain_text"
                                    },
                                  + {
                                      + text = "*Metric definition*"
                                      + type = "mrkdwn"
                                    },
                                  + {
                                      + text = "@{triggerBody()?['data']?['alarmContext']?['condition']?['allOf']?[0]?['metricName']} @{triggerBody()?['data']?['alarmContext']?['condition']?['allOf']?[0]?['operator']} @{triggerBody()?['data']?['alarmContext']?['condition']?['allOf']?[0]?['threshold']}"
                                      + type = "plain_text"
                                    },
                                  + {
                                      + text = "*Metric value recorded*"
                                      + type = "mrkdwn"
                                    },
                                  + {
                                      + text = "@{triggerBody()?['data']?['alarmContext']?['condition']?['allOf']?[0]?['metricValue']} "
                                      + type = "plain_text"
                                    },
                                  + {
                                      + text = "*Alarm status*"
                                      + type = "mrkdwn"
                                    },
                                  + {
                                      + text = "@{triggerBody()?['data']?['essentials']?['monitorCondition']} "
                                      + type = "plain_text"
                                    },
                                ]
                              + type   = "section"
                            },
                        ]
                      + color  = "#FF0000"
                    },
                ]
              + blocks      = [
                  + {
                      + text = {
                          + text = "<!here>"
                          + type = "mrkdwn"
                        }
                      + type = "section"
                    },
                ]
              + channel     = "#ntp-dev-team"
              + text        = "@{triggerBody()?['data']?['essentials']?['alertRule']}: @{triggerBody()?['data']?['essentials']?['description']}"
            }
        )
      + headers      = {
          + "Content-Type" = "application/json"
        }
      + id           = (known after apply)
      + logic_app_id = (known after apply)
      + method       = "POST"
      + name         = "find-a-tp-pr-379-action"
      + uri          = "$ {{ secrets.monitor_slack_webhook_receiver }}"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_logic_app_trigger_http_request.webhook[0] will be created
  + resource "azurerm_logic_app_trigger_http_request" "webhook" {
      + callback_url = (known after apply)
      + id           = (known after apply)
      + logic_app_id = (known after apply)
      + name         = "find-a-tp-pr-379-trigger"
      + schema       = jsonencode(
            {
              + properties = {
                  + data     = {
                      + properties = {
                          + alertContext = {
                              + properties = {}
                              + type       = "object"
                            }
                          + essentials   = {
                              + properties = {
                                  + alertContextVersion = {
                                      + type = "string"
                                    }
                                  + alertId             = {
                                      + type = "string"
                                    }
                                  + alertRule           = {
                                      + type = "string"
                                    }
                                  + alertTargetIDs      = {
                                      + items = {
                                          + type = "string"
                                        }
                                      + type  = "array"
                                    }
                                  + description         = {
                                      + type = "string"
                                    }
                                  + essentialsVersion   = {
                                      + type = "string"
                                    }
                                  + firedDateTime       = {
                                      + type = "string"
                                    }
                                  + monitorCondition    = {
                                      + type = "string"
                                    }
                                  + monitoringService   = {
                                      + type = "string"
                                    }
                                  + originAlertId       = {
                                      + type = "string"
                                    }
                                  + resolvedDateTime    = {
                                      + type = "string"
                                    }
                                  + severity            = {
                                      + type = "string"
                                    }
                                  + signalType          = {
                                      + type = "string"
                                    }
                                }
                              + type       = "object"
                            }
                        }
                      + type       = "object"
                    }
                  + schemaId = {
                      + type = "string"
                    }
                }
              + type       = "object"
            }
        )
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_logic_app_workflow.webhook[0] will be created
  + resource "azurerm_logic_app_workflow" "webhook" {
      + access_endpoint                 = (known after apply)
      + connector_endpoint_ip_addresses = (known after apply)
      + connector_outbound_ip_addresses = (known after apply)
      + enabled                         = true
      + id                              = (known after apply)
      + location                        = "westeurope"
      + name                            = "find-a-tp-pr-379-webhook-workflow"
      + resource_group_name             = "s177d01-ntp-pr-379"
      + tags                            = {
          + "Environment"      = "pr-379"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + workflow_endpoint_ip_addresses  = (known after apply)
      + workflow_outbound_ip_addresses  = (known after apply)
      + workflow_schema                 = "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#"
      + workflow_version                = "1.0.0.0"
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_action_group.web_app_service[0] will be created
  + resource "azurerm_monitor_action_group" "web_app_service" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "find-a-tp-pr-379-actiongroup"
      + resource_group_name = "s177d01-ntp-pr-379"
      + short_name          = "s177d01-ntp-"
      + tags                = {
          + "Environment"      = "pr-379"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }

      + email_receiver {
          + email_address           = "$ {{ secrets.monitor_email_receivers }}"
          + name                    = "Email $ {{ secrets.monitor_email_receivers }}"
          + use_common_alert_schema = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_key_vault[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "default_key_vault" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.OperationalInsights/workspaces/find-a-tp-pr-379-webappservice"
      + name                           = "find-a-tp-pr-379-default-kv-diag"
      + target_resource_id             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-379-kv"

      + enabled_log {
          + category = "AuditEvent"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_redis_cache[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "default_redis_cache" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.OperationalInsights/workspaces/find-a-tp-pr-379-webappservice"
      + name                           = "find-a-tp-pr-379-default-redis-diag"
      + target_resource_id             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Cache/redis/find-a-tp-pr-379-redis-cache"

      + enabled_log {
          + category = "ConnectedClientList"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "web_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Storage/storageAccounts/findatppr379logs|find-a-tp-pr-379-storage-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-379-storage-diag"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.webhook[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "webhook" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.OperationalInsights/workspaces/find-a-tp-pr-379-webappservice"
      + name                           = "find-a-tp-pr-379-webhook-diag"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "WorkflowRuntime"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.cpu[0] will be created
  + resource "azurerm_monitor_metric_alert" "cpu" {
      + auto_mitigate            = true
      + description              = "Action will be triggered when CPU usage is higher than 80% for longer than 5 minutes"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "find-a-tp-pr-379-cpu"
      + resource_group_name      = "s177d01-ntp-pr-379"
      + scopes                   = [
          + "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Web/serverfarms/find-a-tp-pr-379",
        ]
      + severity                 = 2
      + tags                     = {
          + "Environment"      = "pr-379"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "CpuPercentage"
          + metric_namespace       = "microsoft.web/serverfarms"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.http[0] will be created
  + resource "azurerm_monitor_metric_alert" "http" {
      + auto_mitigate            = true
      + description              = "Action will be triggered when regional availability becomes impacted."
      + enabled                  = true
      + frequency                = "PT1M"
      + id                       = (known after apply)
      + name                     = "find-a-tp-pr-379-http"
      + resource_group_name      = "s177d01-ntp-pr-379"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Environment"      = "pr-379"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = (known after apply)
        }

      + application_insights_web_test_location_availability_criteria {
          + component_id          = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Insights/components/find-a-tp-pr-379-insights"
          + failed_location_count = 1
          + web_test_id           = (known after apply)
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.latency[0] will be created
  + resource "azurerm_monitor_metric_alert" "latency" {
      + auto_mitigate            = true
      + description              = "Action will be triggered when Origin latency is higher than 1s"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "find-a-tp-pr-379-cdn-latency"
      + resource_group_name      = "s177d01-ntp-pr-379"
      + scopes                   = [
          + "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Cdn/profiles/find-a-tp-pr-379-cdn",
        ]
      + severity                 = 2
      + tags                     = {
          + "Environment"      = "pr-379"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "TotalLatency"
          + metric_namespace       = "Microsoft.Cdn/profiles"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 1000
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.memory[0] will be created
  + resource "azurerm_monitor_metric_alert" "memory" {
      + auto_mitigate            = true
      + description              = "Action will be triggered when memory usage is higher than 80% for longer than 5 minutes"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "find-a-tp-pr-379-memory"
      + resource_group_name      = "s177d01-ntp-pr-379"
      + scopes                   = [
          + "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Web/serverfarms/find-a-tp-pr-379",
        ]
      + severity                 = 2
      + tags                     = {
          + "Environment"      = "pr-379"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "MemoryPercentage"
          + metric_namespace       = "microsoft.web/serverfarms"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be updated in-place
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379"
        name     = "s177d01-ntp-pr-379"
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-379"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account_network_rules.logs[0] will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "logs" {
        id                         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Storage/storageAccounts/findatppr379logs"
      ~ ip_rules                   = [
          - "172.177.155.147",
            # (1 unchanged element hidden)
        ]
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 12 to add, 4 to change, 0 to destroy.
```
</details>